tutorials/incompressible/pimpleDyMFoam/movingCylinders/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libtopoChangerFvMesh.so"
    "liblduSolvers.so"
)

application     pimpleDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;
deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   0.05;

cycleWrite      0;

writeFormat     ascii;

writeCompression compressed;

timeFormat      general;
writePrecision  10;
timePrecision   10;

runTimeModifiable yes;

adjustTimeStep   on;

maxCo            0.7;


// ************************************************************************* //
