tutorials/incompressible/pimpleDyMFoam/movingCylinders/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           CG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-03;
        relTol           0;
    }
    p
    {
        $p;
        solver           CG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0.0;
    }
    pFinal
    {
        $p;
        relTol           0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0;
    }

    UFinal
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    correctPhi          yes;
    nOuterCorrectors 2;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;

    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    U       0.7;
    UFinal  1;
}


// ************************************************************************* //
